Repository: RedouaneAmourBaracoda/P12-NextRace
Catalog: NextRace/NextRace/Resources/Localizable.xcstrings
Source language: en
Languages: fr

# race-detail.back-button.title
source: Back
fr: Retour

# race-detail.calendar-access-denied-alert.message
source: Access to the calendar was denied.
fr: L'accès à votre calendrier a été restreint. Veuillez autoriser son utilisation pour poursuivre.

# race-detail.calendar-alert.message
source: The event has been successfully added to your calendar.
fr: L'évènement a bien été ajouté à votre calendrier.

# race-detail.calendar-alert.title
source: Event Added
fr: Évènement ajouté

# race-detail.calendar-error-alert.message
source: There was an error adding the event to your calendar.
fr: Une erreur s'est produit lors de l'ajout de l'évènement à votre calendrier. Veuillez réessayer plus tard.

# race-detail.calendar-error-alert.title
source: Error
fr: Erreur

# race-detail.navigation-title
source: Race
fr: Course

# race-detail.schedule-button.title
source: Schedule
fr: Agenda

# races.errors.undetermined.description
source: An expected error occurred and couldn't be determined.
fr: Erreur inattendue survenue lors de la recherche.

# races.ticketMaster-api.errors.bad-request.description
source: Missing parameters in the request or some have incorrect format or values out of allowed range.
fr: Des paramètres sont manquants dans la requête ou certains ont un format incorrect ou des valeurs hors de la plage autorisée.

# races.ticketMaster-api.errors.bad-request.user-friendly-description
source: An expected error occurred and couldn't be determined. Please try again later.
fr: Une erreur inattendue est survenue. Veuillez réessayer ultérieurement.

# races.ticketMaster-api.errors.internal-error.description
source: Unexpected Error due to internal issues.
fr: Erreur inattendue due à des problèmes internes.

# races.ticketMaster-api.errors.invalid-request.description
source: Invalid request
fr: Requête invalide.

# races.ticketMaster-api.errors.invalid-request.user-friendly-description
source: There was an issue with race searching services. Access might be restricted or services are simply down.
fr: Les services de courses rencontrent actuellement un soucis indéterminé. L'accès a pu être restreint ou les services sont momentanément interrompus.

# races.ticketMaster-api.errors.invalid-url.description
source: Invalid URL
fr: URL invalide.

# races.ticketMaster-api.errors.not-found.description
source: Data with requested parameters does not exist in service database
fr: Les données avec les paramètres demandés n’existent pas dans la base de données.

# races.ticketMaster-api.errors.too-many-requests.description
source: Quota of requests was exceeded. Retry request later or after extending your key quota.
fr: La limite de demandes a été dépassé. Essayez de nouveau plus tard ou après avoir étendu votre quota de clés.

# races.ticketMaster-api.errors.too-many-requests.user-friendly-description
source: The limit of requests to race services has been exceeded.
fr: La limite de courses a été dépassée.

# races.ticketMaster-api.errors.unauthorized.description
source: API token not providen in the request or if provided does not grant access to this API.
fr: Token API non fourni dans la requête ou alors ne donne pas accès à cette API.

# search.alert.error.title
source: Error
fr: Erreur

# search.button.title
source: NEXT RACES
fr: PROCHAINES COURSES

# search.cars.title
source: CHAMPIONSHIP
fr: CHAMPIONNAT

# search.country.title
source: COUNTRY
fr: PAYS

# search.result-list.loadmore-button.title
source: Load more
fr: Charger plus

# search.result-list.screen-title
source: RACES
fr: COURSES

# tabs.search.title
source: SEARCH
fr: RECHERCHE
